In [1]:
import pandas as pd

In [2]:
dict = {"name":["muhammet","ahmet","mevlut","hamza","zeynep"],
       "age":[23,27,32,9,3],
       "height":[184,176,191,150,None]}
dataframe = pd.DataFrame(dict)
print(dataframe)

       name  age  height
0  muhammet   23   184.0
1     ahmet   27   176.0
2    mevlut   32   191.0
3     hamza    9   150.0
4    zeynep    3     NaN

In [29]:
import pandas as pd
df = pd.read_excel("example.xlsx")
print(df)

       name  age  height
0  muhammet   23   184.0
1     ahmet   27   176.0
2    mevlut   32   191.0
3     hamza    9   150.0
4    zeynep    3     NaN

In [30]:
head = df.head()
print(head)

       name  age  height
0  muhammet   23   184.0
1     ahmet   27   176.0
2    mevlut   32   191.0
3     hamza    9   150.0
4    zeynep    3     NaN

In [31]:
tail = df.tail()
print(tail)

       name  age  height
0  muhammet   23   184.0
1     ahmet   27   176.0
2    mevlut   32   191.0
3     hamza    9   150.0
4    zeynep    3     NaN

In [32]:
## tail ile head aynı işlevdedir. Sadece tail baştan değil sondan 5 satırı verir.

## Pandas Basic Method

In [33]:
print(df.columns)  # kolon isimlerini verir.

Index(['name', 'age', 'height'], dtype='object')

In [34]:
print(df.info()) # dataframe hakkında bilgi verir.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   height  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes
None

In [35]:
print(df.dtypes) #dataframe in her bir column'ın type'ını verir.

name       object
age         int64
height    float64
dtype: object

In [37]:
print(df.describe()) #describe sadece numeric future'ları verir. Bu yüzden name'i almadı

             age      height
count   5.000000    4.000000
mean   18.800000  175.250000
std    12.296341   17.914147
min     3.000000  150.000000
25%     9.000000  169.500000
50%    23.000000  180.000000
75%    27.000000  185.750000
max    32.000000  191.000000

### Indexing and Slicing

In [49]:
print(df.loc[:,"age"]) # sutun getirmenin bir diğer yolu

0    23
1    27
2    32
3     9
4     3
Name: age, dtype: int64

In [50]:
print(df.loc[:2,"age"]) #pandas'da yazılan sayı dahildir.

0    23
1    27
2    32
Name: age, dtype: int64

In [52]:
print(df.loc[:2, "name":"height"]) # name'den height'e kadar olan kolonların ilk 2 satırını yazdı. 2 dahil

       name  age  height
0  muhammet   23   184.0
1     ahmet   27   176.0
2    mevlut   32   191.0

In [54]:
print(df.loc[:2, ["name","height"]]) #sadece name ve height sutunları alındı

       name  height
0  muhammet   184.0
1     ahmet   176.0
2    mevlut   191.0

In [56]:
print(df.loc[::-1]) # indexleri tersden yazdırdı.

       name  age  height
4    zeynep    3     NaN
3     hamza    9   150.0
2    mevlut   32   191.0
1     ahmet   27   176.0
0  muhammet   23   184.0

In [58]:
print(df.loc[:,:"age"]) # age'e kadar olan tum satırları yazdırdı. age dahil.

       name  age
0  muhammet   23
1     ahmet   27
2    mevlut   32
3     hamza    9
4    zeynep    3

In [62]:
print(df.iloc[:,[1]]) # 1.indexdeki kolonun tum satırlarını verir.

   age
0   23
1   27
2   32
3    9
4    3

In [63]:
# iloc vs loc : iloc sadece int değerleri ile arama yapabiliyor. loc'da string de var.

## Filtering Pandas Data Frame

In [65]:
filtre = df.age < 20  # yası 20den kucuk olanları filtreledik.
df["bool"] = filtre
print(df.loc[:,["age","bool"]])

   age   bool
0   23  False
1   27  False
2   32  False
3    9   True
4    3   True

In [66]:
type(filtre)

pandas.core.series.Series

In [67]:
# numpy'da -> vektör, pandas'da -> series deniliyor. Serilerin birleşmesine ise dataframe denir.

In [69]:
filtre_data = df[filtre] # sadece kosulu sağlayanlar yazıldı.
print(filtre_data)

     name  age  height  bool
3   hamza    9   150.0  True
4  zeynep    3     NaN  True

In [70]:
filtre2 = df.height < 160
filtre_data2 = df[filtre & filtre2]
print(filtre_data2)

    name  age  height  bool
3  hamza    9   150.0  True

In [71]:
## Not
# Bu şekilde de filtreleme uygulayabiliriz.

In [72]:
df[df.age < 20]

     name  age  height  bool
3   hamza    9   150.0  True
4  zeynep    3     NaN  True

## List Comprehension

In [74]:
import numpy as np
avg = df.age.mean() # pandas ile ortalama bulma
print(avg)

avg_np = np.mean(df.age) # numpy ile ortalama bulma
print(avg_np)

18.8
18.8

In [75]:
print(df)

       name  age  height   bool
0  muhammet   23   184.0  False
1     ahmet   27   176.0  False
2    mevlut   32   191.0  False
3     hamza    9   150.0   True
4    zeynep    3     NaN   True

In [77]:
df.dropna(inplace=True) # dropna ile Nan'ları sildik. inplace=True, olayı kalıcı yapar:
print(df)

       name  age  height   bool
0  muhammet   23   184.0  False
1     ahmet   27   176.0  False
2    mevlut   32   191.0  False
3     hamza    9   150.0   True

In [78]:
print(df.age.mean()) # ortalama yas alındı.
df["ortalama"] = ["Ortalamanın altında" if df.age.mean() > each else "ortalamanın üzerinde" for each in df.age]
df

22.75

       name  age  height   bool              ortalama
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [79]:
# list comprehension ile tek bir satırda if-else ve for kullandık.

In [82]:
df.columns = [each.upper() for each in df.columns] # kolonları büyülttük.
df.columns

Index(['NAME', 'AGE', 'HEIGHT', 'BOOL', 'ORTALAMA'], dtype='object')

## Concatenating Data

In [84]:
df

       NAME  AGE  HEIGHT   BOOL              ORTALAMA
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [87]:
df.drop(["ORTALAMA"],axis = 1) # axis'in yanına inplace=True eklersek kalıcı siler.  axis = 1 sutun , axis = 0 satırı siler.
df

       NAME  AGE  HEIGHT   BOOL              ORTALAMA
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [88]:
df

       NAME  AGE  HEIGHT   BOOL              ORTALAMA
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [91]:
#verticle(dikey) birleştirme:->  #concat() metodu ile iki dataframe'i birleştirdik  axis = 0
data1 = df.head()     
data2 = df.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

       NAME  AGE  HEIGHT   BOOL              ORTALAMA
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [92]:
#horizontal(yatay) birleştirme
data_contact2 = pd.concat([data1,data2],axis=1) #axis= 1 yazarak stunları birleştirdik
data_contact2

,NAME,AGE,HEIGHT,BOOL,ORTALAMA,NAME,AGE,HEIGHT,BOOL,ORTALAMA
0,muhammet,23,184.0,False,ortalamanın üzerinde,muhammet,23,184.0,False,ortalamanın üzerinde
1,ahmet,27,176.0,False,ortalamanın üzerinde,ahmet,27,176.0,False,ortalamanın üzerinde
2,mevlut,32,191.0,False,ortalamanın üzerinde,mevlut,32,191.0,False,ortalamanın üzerinde
3,hamza,9,150.0,True,Ortalamanın altında,hamza,9,150.0,True,Ortalamanın altında

In [93]:
## Not : vertical birleştirmede frame'ler kendi sıralamasını kullanarak birlesdi.

## Transforming Data

In [94]:
df

       NAME  AGE  HEIGHT   BOOL              ORTALAMA
0  muhammet   23   184.0  False  ortalamanın üzerinde
1     ahmet   27   176.0  False  ortalamanın üzerinde
2    mevlut   32   191.0  False  ortalamanın üzerinde
3     hamza    9   150.0   True   Ortalamanın altında

In [96]:
def mlt(age):
    return age *2
df["apply metodu"] = df.AGE.apply(mlt)
df

       NAME  AGE  HEIGHT   BOOL              ORTALAMA  apply metodu
0  muhammet   23   184.0  False  ortalamanın üzerinde            46
1     ahmet   27   176.0  False  ortalamanın üzerinde            54
2    mevlut   32   191.0  False  ortalamanın üzerinde            64
3     hamza    9   150.0   True   Ortalamanın altında            18

In [97]:
## apply() fonksiyonu içerisinde lambda kullanarak var olan degiskenin içerisinde degisiklik yapılabilir ya da 
## DataFrame objesi içerisinde yer alan değişkenlerden yeni değişkenler türetebiliriz.